### SQL in 10 Minutes
#### Lesson V
`AGGREGATE`, `GROUP BY`, `HAVING`

`AVG`, `COUNT`, `MAX`, `MIN`, `SUM` are contained

In [1]:
import sqlite3 
import pandas as pd

In [2]:
db = 'tysql.sqlite'
conn = sqlite3.connect(db)

In [3]:
tables = pd.read_sql("""SELECT * FROM sqlite_master WHERE type = 'table';""", conn)
tables

,type,name,tbl_name,rootpage,sql
0,table,Customers,Customers,2,CREATE TABLE Customers\n(\n cust_id char...
1,table,OrderItems,OrderItems,4,CREATE TABLE OrderItems\n(\n order_num int ...
2,table,Orders,Orders,7,CREATE TABLE Orders\n(\n order_num int ...
3,table,Products,Products,10,CREATE TABLE Products\n(\n prod_id char(10...
4,table,Vendors,Vendors,12,CREATE TABLE Vendors\n(\n vend_id char(1...

In [5]:
sql = """
        select avg(prod_price) as avg_price
        from Products;
        """

In [6]:
ex1 = pd.read_sql(sql, conn)
ex1

   avg_price
0   6.823333

In [7]:
sql = """
        select avg(prod_price) as avg_price
        from Products
        where vend_id = 'DLL01';
        """

In [8]:
ex2 = pd.read_sql(sql, conn)
ex2

   avg_price
0      3.865

To be clear, the avg function will ignore rows with value `NULL`

In [9]:
sql = """
        select count(*) as num_cust
        from Customers;
        """

In [10]:
ex3 = pd.read_sql(sql, conn)
ex3

   num_cust
0         5

In [11]:
sql = """
        select count(cust_email) as num_cust
        from Customers;
        """

In [12]:
ex4 = pd.read_sql(sql, conn)
ex4

   num_cust
0         3

So here we see that `COUNT(*)` will include those rows with value `NULL`

In [13]:
sql = """
        select max(prod_price) as max_price
        from Products;
        """

In [14]:
ex5 = pd.read_sql(sql, conn)
ex5

   max_price
0      11.99

In [15]:
sql = """
        select max(prod_price) as max_price, min(prod_price) as min_price
        from Products;
        """

In [16]:
ex6 = pd.read_sql(sql, conn)
ex6

   max_price  min_price
0      11.99       3.49

In [17]:
sql = """
        select sum(quantity) as items_ordered
        from OrderItems
        where order_num = 20005;
        """

In [18]:
ex7 = pd.read_sql(sql, conn)
ex7

   items_ordered
0            200

In [21]:
sql = """
        select *
        from OrderItems
        where order_num = 20005;
        """

In [22]:
od = pd.read_sql(sql, conn)
od

   order_num  order_item prod_id  quantity  item_price
0      20005           1    BR01       100        5.49
1      20005           2    BR03       100       10.99

In [19]:
sql = """
        select sum(quantity * item_price) as total_price
        from OrderItems
        where order_num = 20005;
        """

In [20]:
ex8 = pd.read_sql(sql, conn)
ex8

   total_price
0       1648.0

So we see that this result is a one-one broadcast of the list in `od`

In [23]:
sql = """
        select avg(distinct prod_price) as avg_price
        from Products
        where vend_id = 'DLL01';
        """

In [24]:
ex9 = pd.read_sql(sql, conn)
ex9

   avg_price
0       4.24

In [25]:
sql = """
        select count(*) as num_items, min(prod_price) as price_min, avg(prod_price) as price_avg
        from Products;
        """

In [26]:
ex10 = pd.read_sql(sql, conn)
ex10

   num_items  price_min  price_avg
0          9       3.49   6.823333